"use client";
import Navbar from "@/Components/Navbar/Navbar";
import { getCookie } from "cookies-next";
import { useEffect, useState } from "react";

const AboutUs = () => {
  const lang = getCookie("NEXT_LOCALE");
  const [hydrated, setHydrated] = useState(false);

  useEffect(() => {
    setHydrated(true);
  }, []);
  return (
    <div className="w-[100%] mx-auto h-full flex flex-col py-4  overflow-hidden">
      <div className="lg:w-[1344px] w-[95%] mx-auto pt-6 z-10">
        <Navbar lang={lang} />
      </div>
      <div className="bg-[#FFF] pt-28 lg:px-12 px-4 lg:w-[1344px] mx-auto relative">
        <h1 className="font-notoKufi-400 text-[#1212120D] text-[180px]  absolute  -top-[4.5rem] right-0 lg:w-[1344px]">
          من نحن
        </h1>
        <p className="font-notoKufi-400 text-[#4C4C4C] text-lg">
          اعتمد سمو الشيخ حمدان بن محمد بن راشد آل مكتوم ولي عهد دبي رئيس المجلس
          التنفيذي رئيس مجلس أمناء مؤسسة دبي للمستقبل، اليوم (الأربعاء) حزمة من
          المشاريع التحولية في قطاعات النقل والطيران والصحة في دبي، وذلك ضمن
          المرحلة الثالثة لمبادرة “دبي 10X” والتي تهدف لجعل دبي من أفضل مدن
          المستقبل من خلال تنبي منهجية استباقية ترتكز على إحداث نقلة نوعية في
          فكر موظفي القطاع الحكومي لتطوير مبادرات ومشاريع مستقبلية وغير تقليدية
          على مستوى العالم.
        </p>
        <p className="font-notoKufi-400 text-[#4C4C4C] text-lg mt-6">
          وقال سموه: “اطلعت اليوم على حزمة مشاريع جديدة ونوعية لتسريع مسيرة دبي
          نحو المستقبل… وهدفنا أن تنعكس نتائج هذه المشاريع بشكل واضح على جودة
          حياة جميع سكان وزوار دبي وأن تسهم بتسهيل حياتهم وأعالمهم وتضمن جودة
          حياتهم وصحتهم”.
        </p>
        {/* do not touch it's a boom */}
        <div className="font-notoKufi-600 text-black text-lg  mx-auto  mt-6 relative overflow-y-clip  p-2">
          <p className=" text-white relative z-10 py-4">
            {" "}
            وقال سموه: “اطلعت اليوم على حزمة مشاريع جديدة ونوعية لتسريع مسيرة
            دبي نحو المستقبل… وهدفنا أن تنعكس نتائج هذه المشاريع بشكل واضح على
            جودة حياة جميع سكان وزوار دبي وأن تسهم
          </p>
          <div
            className={`bg-black h-screen absolute top-0 w-[300vw] ${
              hydrated ? (lang === "en" ? "-right-20" : "-left-20") : ""
            }`}
          ></div>
        </div>
        {/* end of the boom  */}
        <p className="font-notoKufi-400 text-[#4C4C4C] text-lg mt-6">
          اعتمد سمو الشيخ حمدان بن محمد بن راشد آل مكتوم ولي عهد دبي رئيس المجلس
          التنفيذي رئيس مجلس أمناء مؤسسة دبي للمستقبل، اليوم (الأربعاء) حزمة من
          المشاريع التحولية في قطاعات النقل والطيران والصحة في دبي، وذلك ضمن
          المرحلة الثالثة لمبادرة “دبي 10X” والتي تهدف لجعل دبي من أفضل مدن
          المستقبل من خلال تنبي منهجية استباقية ترتكز على إحداث نقلة نوعية في
          فكر موظفي القطاع الحكومي لتطوير مبادرات ومشاريع مستقبلية وغير تقليدية
          على مستوى العالم.
        </p>
        <p className="font-notoKufi-400 text-[#4C4C4C] text-lg mt-6">
          وقال سموه: “اطلعت اليوم على حزمة مشاريع جديدة ونوعية لتسريع مسيرة دبي
          نحو المستقبل… وهدفنا أن تنعكس نتائج هذه المشاريع بشكل واضح على جودة
          حياة جميع سكان وزوار دبي وأن تسهم بتسهيل حياتهم وأعالمهم وتضمن جودة
          حياتهم وصحتهم”.اعتمد سمو الشيخ حمدان بن محمد بن راشد آل مكتوم ولي عهد
          دبي رئيس المجلس التنفيذي رئيس مجلس أمناء مؤسسة دبي للمستقبل، اليوم
          (الأربعاء) حزمة من المشاريع التحولية في قطاعات النقل والطيران والصحة
          في دبي، وذلك ضمن المرحلة الثالثة لمبادرة “دبي 10X” والتي تهدف لجعل دبي
          من أفضل مدن المستقبل من خلال تنبي منهجية استباقية ترتكز على إحداث نقلة
          نوعية في فكر موظفي القطاع الحكومي لتطوير مبادرات ومشاريع مستقبلية وغير
          تقليدية على مستوى العالم.
        </p>
        <p className="font-notoKufi-400 text-[#4C4C4C] text-lg mt-6">
          وقال سموه: “اطلعت اليوم على حزمة مشاريع جديدة ونوعية لتسريع مسيرة دبي
          نحو المستقبل… وهدفنا أن تنعكس نتائج هذه المشاريع بشكل واضح على جودة
          حياة جميع سكان وزوار دبي وأن تسهم بتسهيل حياتهم وأعالمهم وتضمن جودة
          حياتهم وصحتهم”.اعتمد سمو الشيخ حمدان بن محمد بن راشد آل مكتوم ولي عهد
          دبي رئيس المجلس التنفيذي رئيس مجلس أمناء مؤسسة دبي للمستقبل، اليوم
          (الأربعاء) حزمة من المشاريع التحولية في قطاعات النقل والطيران والصحة
          في دبي، وذلك ضمن المرحلة الثالثة لمبادرة “دبي 10X” والتي تهدف لجعل دبي
          من أفضل مدن المستقبل من خلال تنبي منهجية استباقية ترتكز على إحداث نقلة
          نوعية في فكر موظفي القطاع الحكومي لتطوير مبادرات ومشاريع مستقبلية وغير
          تقليدية على مستوى العالم.
        </p>
        <p className="font-notoKufi-400 text-[#4C4C4C] text-lg mt-6">
          وقال سموه: “اطلعت اليوم على حزمة مشاريع جديدة ونوعية لتسريع مسيرة دبي
          نحو المستقبل… وهدفنا أن تنعكس نتائج هذه المشاريع بشكل واضح على جودة
          حياة جميع سكان وزوار دبي وأن تسهم بتسهيل حياتهم وأعالمهم وتضمن جودة
          حياتهم وصحتهم”.
        </p>
        {/* <div className="mt-6 bg-black py-6 pl-16  w-screen bg-">
        </div> */}
      </div>
    </div>
  );
};
export default AboutUs;
